{
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "SkO6x_DENfVS"
      },
      "source": [
        "# Implementing EDAM inferences\n",
        "\n",
        "## Working on a toy example"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 1,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "bic7lfnooe6_",
        "outputId": "7175b56f-eac1-4b0d-c9a1-b4266adbb7b4"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Requirement already satisfied: rdflib in /Users/gaignard-a/miniconda3/envs/abromics-kg/lib/python3.10/site-packages (7.0.0)\n",
            "Requirement already satisfied: isodate<0.7.0,>=0.6.0 in /Users/gaignard-a/miniconda3/envs/abromics-kg/lib/python3.10/site-packages (from rdflib) (0.6.1)\n",
            "Requirement already satisfied: pyparsing<4,>=2.1.0 in /Users/gaignard-a/miniconda3/envs/abromics-kg/lib/python3.10/site-packages (from rdflib) (3.1.2)\n",
            "Requirement already satisfied: six in /Users/gaignard-a/miniconda3/envs/abromics-kg/lib/python3.10/site-packages (from isodate<0.7.0,>=0.6.0->rdflib) (1.16.0)\n"
          ]
        }
      ],
      "source": [
        "!pip install rdflib\n",
        "\n",
        "from rdflib import Graph"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 2,
      "metadata": {
        "id": "FxjFzOIWPOv4"
      },
      "outputs": [],
      "source": [
        "my_edam_light = \"\"\"\n",
        "@prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .\n",
        "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
        "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
        "@prefix edam: <http://edamontology.org/> .\n",
        "\n",
        "edam:C rdf:type owl:Class .\n",
        "edam:C_prime rdf:type owl:Class .\n",
        "edam:Topic_1 rdf:type owl:Class .\n",
        "edam:Operation_1 rdf:type owl:Class .\n",
        "edam:Data_1 rdf:type owl:Class .\n",
        "\n",
        "edam:C rdfs:subClassOf edam:C_prime .\n",
        "\n",
        "## C_prime --> implies --> Topic 1 .\n",
        "edam:C_prime  rdfs:subClassOf [\n",
        "        rdf:type owl:Restriction ;\n",
        "        owl:onProperty edam:has_topic ;\n",
        "        owl:someValuesFrom edam:Topic_1 ;\n",
        "    ] .\n",
        "### --> ASSERTION 1: C should have topic Topic1 (by transitivity of subClassOf)\n",
        "\n",
        "## Topic1 --> implies --> Operation 1\n",
        "edam:Topic_1 rdfs:subClassOf [\n",
        "        rdf:type owl:Restriction ;\n",
        "        owl:onProperty edam:has_operation ;\n",
        "        owl:someValuesFrom edam:Operation_1 ;\n",
        "    ] .\n",
        "### --> ASSERTION 2: C should have operation Operation_1\n",
        "\n",
        "## Operation 1 --> implies --> Data 1 as OUTPUT\n",
        "edam:Operation_1 rdfs:subClassOf [\n",
        "        rdf:type owl:Restriction ;\n",
        "        owl:onProperty edam:has_output ;\n",
        "        owl:someValuesFrom edam:Data_1 ;\n",
        "    ] .\n",
        "### --> ASSERTION 3: C should have as output Data_1\n",
        "\n",
        "\n",
        "edam:Topic_1 rdfs:subClassOf edam:Topic_2 .\n",
        "edam:Topic_2 rdfs:subClassOf [\n",
        "        rdf:type owl:Restriction ;\n",
        "        owl:onProperty edam:has_operation ;\n",
        "        owl:someValuesFrom edam:Operation_2 ;\n",
        "    ] .\n",
        "### --> ASSERTION 4: C should have operation Operation_2\n",
        "\n",
        "## Operation 2 --> implies --> Data 2 as INPUT\n",
        "edam:Operation_2 rdfs:subClassOf [\n",
        "        rdf:type owl:Restriction ;\n",
        "        owl:onProperty edam:has_input ;\n",
        "        owl:someValuesFrom edam:Data_2 ;\n",
        "    ] .\n",
        "### --> ASSERTION 5: C should have as input Data_2\n",
        "\n",
        "\"\"\""
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 3,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "Ez-xIcHJRDir",
        "outputId": "2c5070e7-87e1-423e-a36e-b2ae7c412b32"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "27\n",
            "@prefix edam: <http://edamontology.org/> .\n",
            "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
            "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
            "\n",
            "edam:C a owl:Class ;\n",
            "    rdfs:subClassOf edam:C_prime .\n",
            "\n",
            "edam:C_prime a owl:Class ;\n",
            "    rdfs:subClassOf [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_topic ;\n",
            "            owl:someValuesFrom edam:Topic_1 ] .\n",
            "\n",
            "edam:Data_1 a owl:Class .\n",
            "\n",
            "edam:Operation_1 a owl:Class ;\n",
            "    rdfs:subClassOf [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_output ;\n",
            "            owl:someValuesFrom edam:Data_1 ] .\n",
            "\n",
            "edam:Operation_2 rdfs:subClassOf [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_input ;\n",
            "            owl:someValuesFrom edam:Data_2 ] .\n",
            "\n",
            "edam:Topic_1 a owl:Class ;\n",
            "    rdfs:subClassOf [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_operation ;\n",
            "            owl:someValuesFrom edam:Operation_1 ],\n",
            "        edam:Topic_2 .\n",
            "\n",
            "edam:Topic_2 rdfs:subClassOf [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_operation ;\n",
            "            owl:someValuesFrom edam:Operation_2 ] .\n",
            "\n",
            "\n"
          ]
        }
      ],
      "source": [
        "kg = Graph()\n",
        "kg.parse(data=my_edam_light, format=\"turtle\")\n",
        "print(len(kg))\n",
        "print(kg.serialize(format=\"turtle\"))"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "NIPvWfF9ZA3z"
      },
      "source": [
        "Sous la forme de règles :\n",
        "```\n",
        "RULE1: C hasTopic T AND T hasOperation O --> C hasOperation O\n",
        "RULE2: C hasOperation O AND O hasInput D --> C hasInput D\n",
        "RULE3: C hasOperation O AND O hasOutput D --> C hasOutput D\n",
        "RULE4: C hasInput D AND D hasTopic T --> C hasTopic T\n",
        "RULE5: C hasOutput D AND D hasTopic T --> C hasTopic T\n",
        "RULE6: C hasInput D AND D hasOperation O --> C hasOperation O\n",
        "RULE7: C hasOutput D AND D hasOperation O --> C hasOperation O\n",
        "```\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 42,
      "metadata": {
        "id": "A0--kYdnZc3y"
      },
      "outputs": [],
      "source": [
        "import time\n",
        "\n",
        "rule_subClassOf = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/>\n",
        "CONSTRUCT {\n",
        "  ?concept edam:has_topic ?topic ;\n",
        "           edam:has_operation ?operation ;\n",
        "           edam:has_input ?in_data ;\n",
        "           edam:has_output ?out_data .\n",
        "\n",
        "} WHERE {\n",
        "    ?concept rdfs:subClassOf* ?super_concept .\n",
        "    OPTIONAL { ?super_concept edam:has_topic ?topic } .\n",
        "    OPTIONAL { ?super_concept edam:has_operation ?operation } .\n",
        "    OPTIONAL { ?super_concept edam:has_input ?in_data } .\n",
        "    OPTIONAL { ?super_concept edam:has_output ?out_data } .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "rule_0 = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/>\n",
        "CONSTRUCT {\n",
        "  ?concept ?rel ?class .\n",
        "  ?class rdf:type owl:Class .\n",
        "} WHERE {\n",
        "    ?concept rdfs:subClassOf [\n",
        "        rdf:type owl:Restriction ;\n",
        "        owl:onProperty ?rel ;\n",
        "        owl:someValuesFrom ?class ;\n",
        "    ] .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "rule_1 = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/>\n",
        "CONSTRUCT {\n",
        "  ?concept edam:has_operation ?operation .\n",
        "} WHERE {\n",
        "  ?concept rdf:type owl:Class .\n",
        "  ?concept edam:has_topic ?topic .\n",
        "  ?topic edam:has_operation ?operation .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "rule_1_bis = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/>\n",
        "CONSTRUCT {\n",
        "  ?concept edam:has_topic ?topic .\n",
        "} WHERE {\n",
        "  ?concept rdf:type owl:Class .\n",
        "  ?concept edam:has_operation ?operation .\n",
        "  ?operation edam:has_topic ?topic .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "rule_2 = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/>\n",
        "CONSTRUCT {\n",
        "  ?concept edam:has_input ?data .\n",
        "} WHERE {\n",
        "  ?concept rdf:type owl:Class .\n",
        "  ?concept edam:has_operation ?op .\n",
        "  ?op edam:has_input ?data .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "rule_3 = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/>\n",
        "CONSTRUCT {\n",
        "  ?concept edam:has_output ?data .\n",
        "} WHERE {\n",
        "  ?concept rdf:type owl:Class .\n",
        "  ?concept edam:has_operation ?op .\n",
        "  ?op edam:has_output ?data .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "rule_4 = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/>\n",
        "CONSTRUCT {\n",
        "  ?concept edam:has_topic ?topic .\n",
        "} WHERE {\n",
        "  ?concept rdf:type owl:Class .\n",
        "  ?concept edam:has_input ?data .\n",
        "  ?data edam:has_topic ?topic .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "rule_5 = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/>\n",
        "CONSTRUCT {\n",
        "  ?concept edam:has_topic ?topic .\n",
        "} WHERE {\n",
        "  ?concept rdf:type owl:Class .\n",
        "  ?concept edam:has_output ?data .\n",
        "  ?data edam:has_topic ?topic .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "rule_6 = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/>\n",
        "CONSTRUCT {\n",
        "  ?concept edam:has_operation ?operation .\n",
        "} WHERE {\n",
        "  ?concept rdf:type owl:Class .\n",
        "  ?concept edam:has_input ?data .\n",
        "  ?data edam:has_operation ?operation .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "rule_7 = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/>\n",
        "CONSTRUCT {\n",
        "  ?concept edam:has_operation ?operation .\n",
        "} WHERE {\n",
        "  ?concept rdf:type owl:Class .\n",
        "  ?concept edam:has_output ?data .\n",
        "  ?data edam:has_operation ?operation .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "rules = [rule_0, rule_1, rule_1_bis, rule_2, rule_3, rule_4, rule_5, rule_6, rule_7]\n",
        "\n",
        "\n",
        "def apply_all_rules(kg):\n",
        "    \"\"\"\n",
        "    Apply the construct rules defined in the rules parameter, as well as the\n",
        "    transitivity of subClassOf\n",
        "    \"\"\"\n",
        "\n",
        "    inferred_kg = Graph()\n",
        "    inferred_kg += kg\n",
        "\n",
        "    for i, rule in enumerate(rules):\n",
        "        res_kg = inferred_kg.query(rule).graph\n",
        "        print(\n",
        "            f\"{len(inferred_kg + res_kg) - len(inferred_kg)} triples generated from rule {i}\"\n",
        "        )\n",
        "        inferred_kg = inferred_kg + res_kg\n",
        "\n",
        "    res_kg = inferred_kg.query(rule_subClassOf).graph\n",
        "    print(\n",
        "        f\"{len(inferred_kg + res_kg) - len(inferred_kg)} triples generated from rule subClassOf\"\n",
        "    )\n",
        "    inferred_kg = inferred_kg + res_kg\n",
        "\n",
        "    return inferred_kg\n",
        "\n",
        "\n",
        "def transitive_closure(kg):\n",
        "    \"\"\"\n",
        "    Apply the collection of inference rules iteratively until no new triples are generated.\n",
        "    Apply rules for 10 iteration max\n",
        "    Return the resulting knowledge graph.\n",
        "    \"\"\"\n",
        "    card_new_triples = 1\n",
        "    i = 1\n",
        "    while card_new_triples > 0:\n",
        "        timer = time.time()\n",
        "\n",
        "        kg_with_inferrences = apply_all_rules(kg)\n",
        "\n",
        "        new_triples = kg_with_inferrences - kg\n",
        "        card_new_triples = len(new_triples)\n",
        "        print(f\"Inferred {card_new_triples} new triples\")\n",
        "\n",
        "        kg += kg_with_inferrences\n",
        "        duration = time.time() - timer\n",
        "        print(f\"Iteration {i} Duration : {round(duration, 2)}s\")\n",
        "        i += 1\n",
        "        if i > 10:\n",
        "            break\n",
        "    return kg"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 43,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "XH9gbv1zdITx",
        "outputId": "09f6800c-3cd9-4e60-a362-ac60d41dce11"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "0 triples generated from rule 0\n",
            "0 triples generated from rule 1\n",
            "0 triples generated from rule 2\n",
            "0 triples generated from rule 3\n",
            "0 triples generated from rule 4\n",
            "0 triples generated from rule 5\n",
            "0 triples generated from rule 6\n",
            "0 triples generated from rule 7\n",
            "0 triples generated from rule 8\n",
            "0 triples generated from rule subClassOf\n",
            "Inferred 0 new triples\n",
            "Iteration 1 Duration : 0.05s\n",
            "46\n",
            "@prefix edam: <http://edamontology.org/> .\n",
            "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
            "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
            "\n",
            "edam:C a owl:Class ;\n",
            "    edam:has_input edam:Data_2 ;\n",
            "    edam:has_operation edam:Operation_1,\n",
            "        edam:Operation_2 ;\n",
            "    edam:has_output edam:Data_1 ;\n",
            "    edam:has_topic edam:Topic_1 ;\n",
            "    rdfs:subClassOf edam:C_prime .\n",
            "\n",
            "edam:C_prime a owl:Class ;\n",
            "    edam:has_input edam:Data_2 ;\n",
            "    edam:has_operation edam:Operation_1,\n",
            "        edam:Operation_2 ;\n",
            "    edam:has_output edam:Data_1 ;\n",
            "    edam:has_topic edam:Topic_1 ;\n",
            "    rdfs:subClassOf [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_topic ;\n",
            "            owl:someValuesFrom edam:Topic_1 ] .\n",
            "\n",
            "edam:Topic_2 edam:has_operation edam:Operation_2 ;\n",
            "    rdfs:subClassOf [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_operation ;\n",
            "            owl:someValuesFrom edam:Operation_2 ] .\n",
            "\n",
            "edam:Topic_1 a owl:Class ;\n",
            "    edam:has_input edam:Data_2 ;\n",
            "    edam:has_operation edam:Operation_1,\n",
            "        edam:Operation_2 ;\n",
            "    edam:has_output edam:Data_1 ;\n",
            "    rdfs:subClassOf [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_operation ;\n",
            "            owl:someValuesFrom edam:Operation_1 ],\n",
            "        edam:Topic_2 .\n",
            "\n",
            "edam:Operation_1 a owl:Class ;\n",
            "    edam:has_output edam:Data_1 ;\n",
            "    rdfs:subClassOf [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_output ;\n",
            "            owl:someValuesFrom edam:Data_1 ] .\n",
            "\n",
            "edam:Data_1 a owl:Class .\n",
            "\n",
            "edam:Data_2 a owl:Class .\n",
            "\n",
            "edam:Operation_2 a owl:Class ;\n",
            "    edam:has_input edam:Data_2 ;\n",
            "    rdfs:subClassOf [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_input ;\n",
            "            owl:someValuesFrom edam:Data_2 ] .\n",
            "\n",
            "\n"
          ]
        }
      ],
      "source": [
        "kg_2 = transitive_closure(kg)\n",
        "print(len(kg_2))\n",
        "print(kg_2.serialize(format=\"turtle\"))"
      ]
    },
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "VyT9Iz8SNsMC"
      },
      "source": [
        "## Applying the same rule set to the full bio.tools and EDAM knowledge graph"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 44,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "iq96zNvqNr6I",
        "outputId": "f58b6a3a-e97e-45c1-82e0-fab1cebdf8b0"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Successfully loaded EDAM: 38792 triples\n"
          ]
        }
      ],
      "source": [
        "full_kg = Graph()\n",
        "full_kg.parse(\"https://edamontology.org/EDAM.owl\", format=\"xml\")\n",
        "print(f\"Successfully loaded EDAM: {len(full_kg)} triples\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 45,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "NR7FrjFgbVGD",
        "outputId": "cf9dbe9c-5702-4c93-9733-6085f8bae6bd"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Successfully loaded bio.tools: 672116 triples\n"
          ]
        }
      ],
      "source": [
        "full_kg.parse(\n",
        "    \"https://github.com/research-software-ecosystem/content/raw/refs/heads/master/datasets/bioschemas-dump.ttl\",\n",
        "    format=\"turtle\",\n",
        ")\n",
        "print(f\"Successfully loaded bio.tools: {len(full_kg)} triples\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 46,
      "metadata": {
        "colab": {
          "background_save": true,
          "base_uri": "https://localhost:8080/"
        },
        "id": "rvVQoD4wn05g",
        "outputId": "12deca33-fb11-4e49-b19b-1402ad90eae0"
      },
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "604 triples generated from rule 0\n",
            "0 triples generated from rule 1\n",
            "0 triples generated from rule 2\n",
            "0 triples generated from rule 3\n",
            "0 triples generated from rule 4\n",
            "25 triples generated from rule 5\n",
            "17 triples generated from rule 6\n",
            "0 triples generated from rule 7\n",
            "0 triples generated from rule 8\n",
            "1549 triples generated from rule subClassOf\n",
            "Inferred 2195 new triples\n",
            "Iteration 1 Duration : 140.52s\n",
            "0 triples generated from rule 0\n",
            "0 triples generated from rule 1\n",
            "0 triples generated from rule 2\n",
            "0 triples generated from rule 3\n",
            "0 triples generated from rule 4\n",
            "9 triples generated from rule 5\n",
            "12 triples generated from rule 6\n",
            "0 triples generated from rule 7\n",
            "0 triples generated from rule 8\n",
            "0 triples generated from rule subClassOf\n",
            "Inferred 21 new triples\n",
            "Iteration 2 Duration : 148.26s\n",
            "0 triples generated from rule 0\n",
            "0 triples generated from rule 1\n",
            "0 triples generated from rule 2\n",
            "0 triples generated from rule 3\n",
            "0 triples generated from rule 4\n",
            "0 triples generated from rule 5\n",
            "0 triples generated from rule 6\n",
            "0 triples generated from rule 7\n",
            "0 triples generated from rule 8\n",
            "0 triples generated from rule subClassOf\n",
            "Inferred 0 new triples\n",
            "Iteration 3 Duration : 144.44s\n",
            "674332\n"
          ]
        }
      ],
      "source": [
        "full_inferred_kg = transitive_closure(full_kg)\n",
        "print(len(full_inferred_kg))"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 47,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 135
        },
        "id": "nUcUKOMDpqkf",
        "outputId": "bab3341b-7e57-42cf-fe8c-0f5b37c56ec7"
      },
      "outputs": [
        {
          "data": {
            "text/plain": [
              "<Graph identifier=N8b99de6896714ad98a9b4c851a927238 (<class 'rdflib.graph.Graph'>)>"
            ]
          },
          "execution_count": 47,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "full_inferred_kg.serialize(destination=\"out_inf.ttl\", format=\"turtle\")\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 48,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Successfully loaded inferred KG: 674332 triples\n"
          ]
        }
      ],
      "source": [
        "full_inferred_kg = Graph()\n",
        "full_inferred_kg.parse(\"out_inf.ttl\", format=\"turtle\")\n",
        "print(f\"Successfully loaded inferred KG: {len(full_inferred_kg)} triples\")\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 63,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "@prefix biotools: <https://bio.tools/ontology/> .\n",
            "@prefix bsc: <http://bioschemas.org/> .\n",
            "@prefix bsct: <http://bioschemas.org/types/> .\n",
            "@prefix dcterms: <http://purl.org/dc/terms/> .\n",
            "@prefix edam: <http://edamontology.org/> .\n",
            "@prefix sc: <http://schema.org/> .\n",
            "@prefix xsd: <http://www.w3.org/2001/XMLSchema#> .\n",
            "\n",
            "<https://bio.tools/frogs> a sc:SoftwareApplication ;\n",
            "    dcterms:conformsTo \"https://bioschemas.org/profiles/ComputationalTool/0.6-DRAFT\" ;\n",
            "    sc:additionalType \"Command-line tool\" ;\n",
            "    sc:applicationSubCategory edam:topic_0637,\n",
            "        edam:topic_3168,\n",
            "        edam:topic_3174,\n",
            "        edam:topic_3299,\n",
            "        edam:topic_3697 ;\n",
            "    sc:citation <https://doi.org/10.1093/bib/bbab318>,\n",
            "        <https://doi.org/10.1093/bioinformatics/btx791>,\n",
            "        \"pubmed:29228191\",\n",
            "        \"pubmed:34410336\" ;\n",
            "    sc:description \"The user-friendly and Galaxy-supported pipeline FROGS analyses large sets of DNA amplicons sequences accurately and rapidly, essential for microbe community studies.\" ;\n",
            "    sc:featureList edam:operation_3460 ;\n",
            "    sc:license \"GPL-3.0\" ;\n",
            "    sc:name \"FROGS\" ;\n",
            "    sc:operatingSystem \"Linux\" ;\n",
            "    sc:softwareHelp <https://github.com/geraldinepascal/FROGS> ;\n",
            "    sc:softwareVersion \"4.0.0\" ;\n",
            "    sc:url \"http://frogs.toulouse.inra.fr/\" ;\n",
            "    biotools:primaryContact \"Géraldine Pascal\" .\n",
            "\n",
            "<https://bio.tools/multiqc> a sc:SoftwareApplication ;\n",
            "    bsc:output [ a bsct:FormalParameter ;\n",
            "            sc:additionalType edam:data_0867 ;\n",
            "            sc:encodingFormat edam:format_2331 ;\n",
            "            sc:name \"Sequence alignment report\" ],\n",
            "        [ a bsct:FormalParameter ;\n",
            "            sc:additionalType edam:data_3914 ;\n",
            "            sc:encodingFormat edam:format_2331,\n",
            "                edam:format_3464,\n",
            "                edam:format_3475,\n",
            "                edam:format_3750,\n",
            "                edam:format_3752 ;\n",
            "            sc:name \"Quality control report\" ] ;\n",
            "    dcterms:conformsTo \"https://bioschemas.org/profiles/ComputationalTool/0.6-DRAFT\" ;\n",
            "    sc:additionalType \"Command-line tool\",\n",
            "        \"Library\" ;\n",
            "    sc:applicationSubCategory edam:topic_0080,\n",
            "        edam:topic_0091,\n",
            "        edam:topic_0622,\n",
            "        edam:topic_3168 ;\n",
            "    sc:citation <https://doi.org/10.1093/bioinformatics/btw354>,\n",
            "        \"pmcid:PMC5039924\",\n",
            "        \"pubmed:27312411\" ;\n",
            "    sc:description \"MultiQC aggregates results from multiple bioinformatics analyses across many samples into a single report. It searches a given directory for analysis logs and compiles a HTML report. It's a general use tool, perfect for summarising the output from numerous bioinformatics tools.\" ;\n",
            "    sc:featureList edam:operation_2428,\n",
            "        edam:operation_3218 ;\n",
            "    sc:isAccessibleForFree true ;\n",
            "    sc:license \"GPL-3.0\" ;\n",
            "    sc:name \"MultiQC\" ;\n",
            "    sc:operatingSystem \"Linux\",\n",
            "        \"Mac\",\n",
            "        \"Windows\" ;\n",
            "    sc:softwareHelp <http://multiqc.info/docs/> ;\n",
            "    sc:url \"http://multiqc.info/\" ;\n",
            "    biotools:primaryContact <http://orcid.org/0000-0003-4101-2502> .\n",
            "\n",
            "<https://bio.tools/qiime2> a sc:SoftwareApplication ;\n",
            "    dcterms:conformsTo \"https://bioschemas.org/profiles/ComputationalTool/0.6-DRAFT\" ;\n",
            "    sc:additionalType \"Command-line tool\",\n",
            "        \"Library\",\n",
            "        \"Suite\" ;\n",
            "    sc:applicationSubCategory edam:topic_3174,\n",
            "        edam:topic_3697,\n",
            "        edam:topic_3941 ;\n",
            "    sc:citation <https://doi.org/10.1038/s41587-019-0209-9>,\n",
            "        \"pmcid:PMC7015180\",\n",
            "        \"pubmed:31341288\" ;\n",
            "    sc:description \"QIIME 2 is an AI-ready microbiome multi-omics data science platform that is trusted, free, open source, extensible, and community developed and supported bioinformatics.\" ;\n",
            "    sc:featureList edam:operation_0337,\n",
            "        edam:operation_3460,\n",
            "        edam:operation_3933 ;\n",
            "    sc:isAccessibleForFree true ;\n",
            "    sc:license \"BSD-3-Clause\" ;\n",
            "    sc:name \"QIIME 2\" ;\n",
            "    sc:operatingSystem \"Linux\",\n",
            "        \"Mac\",\n",
            "        \"Windows\" ;\n",
            "    sc:softwareHelp <https://amplicon-docs.qiime2.org>,\n",
            "        <https://develop.qiime2.org>,\n",
            "        <https://library.qiime2.org/books>,\n",
            "        <https://moshpit.qiime2.org>,\n",
            "        <https://use.qiime2.org> ;\n",
            "    sc:softwareVersion \"2.0\" ;\n",
            "    sc:url \"https://qiime2.org\" ;\n",
            "    biotools:primaryContact \"Greg Caporaso\" .\n",
            "\n",
            "\n"
          ]
        }
      ],
      "source": [
        "desc_q = \"\"\"\n",
        "DESCRIBE <https://bio.tools/multiqc> <https://bio.tools/qiime2> <https://bio.tools/frogs> \n",
        "\"\"\"\n",
        "res = full_inferred_kg.query(desc_q).graph\n",
        "print(res.serialize(format=\"turtle\"))\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 64,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "MultiQC inferred knowledge graph has 29 triples\n",
            "@prefix ns1: <http://bioschemas.org/> .\n",
            "@prefix ns2: <http://schema.org/> .\n",
            "\n",
            "<https://bio.tools/frogs> ns2:applicationSubCategory <http://edamontology.org/topic_0080>,\n",
            "        <http://edamontology.org/topic_0637>,\n",
            "        <http://edamontology.org/topic_3168>,\n",
            "        <http://edamontology.org/topic_3174>,\n",
            "        <http://edamontology.org/topic_3299>,\n",
            "        <http://edamontology.org/topic_3697> ;\n",
            "    ns2:featureList <http://edamontology.org/operation_3460> .\n",
            "\n",
            "<https://bio.tools/multiqc> ns1:input <http://edamontology.org/data_2977> ;\n",
            "    ns1:output <http://edamontology.org/data_0867>,\n",
            "        <http://edamontology.org/data_3914> ;\n",
            "    ns2:applicationSubCategory <http://edamontology.org/topic_0077>,\n",
            "        <http://edamontology.org/topic_0080>,\n",
            "        <http://edamontology.org/topic_0091>,\n",
            "        <http://edamontology.org/topic_0622>,\n",
            "        <http://edamontology.org/topic_3168> ;\n",
            "    ns2:featureList <http://edamontology.org/operation_2428>,\n",
            "        <http://edamontology.org/operation_3218> .\n",
            "\n",
            "<https://bio.tools/qiime2> ns1:input <http://edamontology.org/data_2968>,\n",
            "        <http://edamontology.org/data_2977> ;\n",
            "    ns1:output <http://edamontology.org/data_2968> ;\n",
            "    ns2:applicationSubCategory <http://edamontology.org/topic_0077>,\n",
            "        <http://edamontology.org/topic_0080>,\n",
            "        <http://edamontology.org/topic_0092>,\n",
            "        <http://edamontology.org/topic_3174>,\n",
            "        <http://edamontology.org/topic_3697>,\n",
            "        <http://edamontology.org/topic_3941> ;\n",
            "    ns2:featureList <http://edamontology.org/operation_0337>,\n",
            "        <http://edamontology.org/operation_3460>,\n",
            "        <http://edamontology.org/operation_3933> .\n",
            "\n",
            "\n"
          ]
        }
      ],
      "source": [
        "q = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/> \n",
        "PREFIX bsc: <http://bioschemas.org/> \n",
        "PREFIX sc: <http://schema.org/> \n",
        "\n",
        "CONSTRUCT {\n",
        "  ?X sc:applicationSubCategory ?topic, ?inf_ot, ?inf_odt, ?inf_idt ;\n",
        "                            sc:featureList ?operation, ?inf_to, ?inf_odo, ?inf_ido ;\n",
        "                            bsc:output ?out_data, ?inf_tod, ?inf_ood ;\n",
        "                            bsc:input ?in_data, ?inf_tid, ?inf_oid  .    \n",
        "} WHERE {\n",
        "    VALUES ?X { <https://bio.tools/multiqc> <https://bio.tools/qiime2> <https://bio.tools/frogs> }\n",
        "    ?X a sc:SoftwareApplication .\n",
        "    OPTIONAL {?X bsc:output/sc:additionalType ?out_data } . \n",
        "    OPTIONAL {?X bsc:output/sc:additionalType/edam:has_topic ?inf_odt } . \n",
        "    OPTIONAL {?X bsc:output/sc:additionalType/edam:has_operation ?inf_odo } . \n",
        "    OPTIONAL {?X bsc:input/sc:additionalType ?in_data } . \n",
        "    OPTIONAL {?X bsc:input/sc:additionalType/edam:has_topic ?inf_idt } . \n",
        "    OPTIONAL {?X bsc:input/sc:additionalType/edam:has_operation ?inf_ido } . \n",
        "    OPTIONAL {?X sc:applicationSubCategory ?topic } .\n",
        "    OPTIONAL {?X sc:applicationSubCategory/edam:has_operation ?inf_to } .\n",
        "    OPTIONAL {?X sc:applicationSubCategory/edam:has_input ?inf_tid } .\n",
        "    OPTIONAL {?X sc:applicationSubCategory/edam:has_output ?inf_tod } .\n",
        "    OPTIONAL {?X sc:featureList ?operation } .\n",
        "    OPTIONAL {?X sc:featureList/edam:has_topic ?inf_ot } .\n",
        "    OPTIONAL {?X sc:featureList/edam:has_input ?inf_oid } .\n",
        "    OPTIONAL {?X sc:featureList/edam:has_output ?inf_ood } .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "res_multiqc = full_inferred_kg.query(q).graph\n",
        "print(f\"MultiQC inferred knowledge graph has {len(res_multiqc)} triples\")\n",
        "print(res_multiqc.serialize(format=\"turtle\"))"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 56,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "MultiQC has topic http://edamontology.org/topic_0080\n",
            "MultiQC has topic http://edamontology.org/topic_0091\n",
            "MultiQC has topic http://edamontology.org/topic_0622\n",
            "MultiQC has topic http://edamontology.org/topic_3168\n"
          ]
        }
      ],
      "source": [
        "desc_q = \"\"\"\n",
        "SELECT * WHERE {\n",
        "<https://bio.tools/multiqc> sc:applicationSubCategory ?inf_tt\n",
        "}\n",
        "\"\"\"\n",
        "res = full_inferred_kg.query(desc_q)\n",
        "for row in res:\n",
        "    print(f\"MultiQC has topic {row.inf_tt}\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 39,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "@prefix edam: <http://edamontology.org/> .\n",
            "@prefix oboInOwl: <http://www.geneontology.org/formats/oboInOwl#> .\n",
            "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
            "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
            "\n",
            "edam:operation_2478 a owl:Class ;\n",
            "    rdfs:label \"Nucleic acid sequence analysis\" ;\n",
            "    edam:created_in \"beta12orEarlier\" ;\n",
            "    edam:has_input edam:data_2977 ;\n",
            "    edam:has_topic edam:topic_0077,\n",
            "        edam:topic_0080 ;\n",
            "    oboInOwl:hasDefinition \"Analyse a nucleic acid sequence (using methods that are only applicable to nucleic acid sequences).\" ;\n",
            "    oboInOwl:hasExactSynonym \"Sequence analysis (nucleic acid)\" ;\n",
            "    oboInOwl:hasNarrowSynonym \"Nucleic acid sequence alignment analysis\",\n",
            "        \"Sequence alignment analysis (nucleic acid)\" ;\n",
            "    oboInOwl:inSubset edam:bio,\n",
            "        edam:operations ;\n",
            "    rdfs:subClassOf [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_topic ;\n",
            "            owl:someValuesFrom edam:topic_0077 ],\n",
            "        [ a owl:Restriction ;\n",
            "            owl:onProperty edam:has_input ;\n",
            "            owl:someValuesFrom edam:data_2977 ],\n",
            "        edam:operation_2403 .\n",
            "\n",
            "\n"
          ]
        }
      ],
      "source": [
        "desc_q = \"\"\"\n",
        "DESCRIBE <http://edamontology.org/operation_2478>\n",
        "\"\"\"\n",
        "res = full_inferred_kg.query(desc_q).graph\n",
        "print(res.serialize(format=\"turtle\"))"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 51,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "@prefix edam: <http://edamontology.org/> .\n",
            "@prefix oboInOwl: <http://www.geneontology.org/formats/oboInOwl#> .\n",
            "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
            "@prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .\n",
            "\n",
            "edam:operation_3218 a owl:Class ;\n",
            "    rdfs:label \"Sequencing quality control\" ;\n",
            "    edam:created_in \"1.1\" ;\n",
            "    edam:has_input edam:data_2977 ;\n",
            "    edam:has_topic edam:topic_0077,\n",
            "        edam:topic_0080 ;\n",
            "    oboInOwl:hasDefinition \"Raw sequence data quality control.\" ;\n",
            "    oboInOwl:hasExactSynonym \"Sequencing QC\",\n",
            "        \"Sequencing quality assessment\" ;\n",
            "    oboInOwl:inSubset edam:bio,\n",
            "        edam:operations ;\n",
            "    rdfs:comment \"Analyse raw sequence data from a sequencing pipeline and identify (and possiby fix) problems.\" ;\n",
            "    rdfs:subClassOf edam:operation_2428,\n",
            "        edam:operation_2478 .\n",
            "\n",
            "\n"
          ]
        }
      ],
      "source": [
        "desc_q = \"\"\"\n",
        "DESCRIBE <http://edamontology.org/operation_3218>\n",
        "\"\"\"\n",
        "res = full_inferred_kg.query(desc_q).graph\n",
        "print(res.serialize(format=\"turtle\"))\n"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 29,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "Successfully loaded EDAM: 38792 triples\n"
          ]
        }
      ],
      "source": [
        "# test R C hasInput D AND D hasOperation O\n",
        "\n",
        "edam_kg = Graph()\n",
        "edam_kg.parse(\"https://edamontology.org/EDAM.owl\", format=\"xml\")\n",
        "print(f\"Successfully loaded EDAM: {len(edam_kg)} triples\")"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "EDAM after rule 0 has 862 triples\n",
            "@prefix ns1: <http://edamontology.org/> .\n",
            "@prefix owl: <http://www.w3.org/2002/07/owl#> .\n",
            "@prefix skos: <http://www.w3.org/2004/02/skos/core#> .\n",
            "\n",
            "ns1:data_0860 ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:data_0940 ns1:has_topic ns1:topic_1317 .\n",
            "\n",
            "ns1:data_0942 ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:data_0944 ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:data_0945 ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:data_0956 ns1:has_topic ns1:topic_3489 .\n",
            "\n",
            "ns1:data_0987 ns1:is_identifier_of ns1:data_0919 .\n",
            "\n",
            "ns1:data_0989 ns1:is_identifier_of ns1:data_0896 .\n",
            "\n",
            "ns1:data_0993 ns1:is_identifier_of ns1:data_2851 .\n",
            "\n",
            "ns1:data_0994 ns1:is_identifier_of ns1:data_2016 .\n",
            "\n",
            "ns1:data_1008 ns1:is_identifier_of ns1:data_1467 .\n",
            "\n",
            "ns1:data_1025 ns1:is_identifier_of ns1:data_0916 .\n",
            "\n",
            "ns1:data_1038 ns1:is_identifier_of ns1:data_1468 .\n",
            "\n",
            "ns1:data_1048 ns1:is_identifier_of ns1:data_0957 .\n",
            "\n",
            "ns1:data_1051 ns1:is_identifier_of ns1:data_0582 .\n",
            "\n",
            "ns1:data_1061 ns1:is_identifier_of ns1:data_0847 .\n",
            "\n",
            "ns1:data_1063 ns1:is_identifier_of ns1:data_2044 .\n",
            "\n",
            "ns1:data_1064 ns1:is_identifier_of ns1:data_0850 .\n",
            "\n",
            "ns1:data_1066 ns1:is_identifier_of ns1:data_0863 .\n",
            "\n",
            "ns1:data_1068 ns1:is_identifier_of ns1:data_0872 .\n",
            "\n",
            "ns1:data_1069 ns1:is_identifier_of ns1:data_0874 .\n",
            "\n",
            "ns1:data_1071 ns1:is_identifier_of ns1:data_0889 .\n",
            "\n",
            "ns1:data_1072 ns1:is_identifier_of ns1:data_0886 .\n",
            "\n",
            "ns1:data_1073 ns1:is_identifier_of ns1:data_1501 .\n",
            "\n",
            "ns1:data_1074 ns1:is_identifier_of ns1:data_0906 .\n",
            "\n",
            "ns1:data_1075 ns1:is_identifier_of ns1:data_0907 .\n",
            "\n",
            "ns1:data_1076 ns1:is_identifier_of ns1:data_1597,\n",
            "        ns1:data_1598 .\n",
            "\n",
            "ns1:data_1078 ns1:is_identifier_of ns1:data_2531 .\n",
            "\n",
            "ns1:data_1079 ns1:is_identifier_of ns1:data_3805 .\n",
            "\n",
            "ns1:data_1080 ns1:is_identifier_of ns1:data_3111 .\n",
            "\n",
            "ns1:data_1081 ns1:is_identifier_of ns1:data_0920 .\n",
            "\n",
            "ns1:data_1082 ns1:is_identifier_of ns1:data_2600 .\n",
            "\n",
            "ns1:data_1085 ns1:is_identifier_of ns1:data_0950 .\n",
            "\n",
            "ns1:data_1086 ns1:is_identifier_of ns1:data_0962 .\n",
            "\n",
            "ns1:data_1088 ns1:is_identifier_of ns1:data_0971 .\n",
            "\n",
            "ns1:data_1096 ns1:is_identifier_of ns1:data_2976 .\n",
            "\n",
            "ns1:data_1097 ns1:is_identifier_of ns1:data_2977 .\n",
            "\n",
            "ns1:data_1112 ns1:is_identifier_of ns1:data_1235 .\n",
            "\n",
            "ns1:data_1114 ns1:is_identifier_of ns1:data_1353 .\n",
            "\n",
            "ns1:data_1115 ns1:is_identifier_of ns1:data_1354 .\n",
            "\n",
            "ns1:data_1118 ns1:is_identifier_of ns1:data_1364 .\n",
            "\n",
            "ns1:data_1126 ns1:is_identifier_of ns1:data_0874 .\n",
            "\n",
            "ns1:data_1132 ns1:is_identifier_of ns1:data_1355 .\n",
            "\n",
            "ns1:data_1133 ns1:is_identifier_of ns1:data_1355 .\n",
            "\n",
            "ns1:data_1134 ns1:is_identifier_of ns1:data_1355 .\n",
            "\n",
            "ns1:data_1162 ns1:is_identifier_of ns1:data_0957 .\n",
            "\n",
            "ns1:data_1163 ns1:is_identifier_of ns1:data_0957 .\n",
            "\n",
            "ns1:data_1164 ns1:is_identifier_of ns1:data_0957 .\n",
            "\n",
            "ns1:data_1463 ns1:has_topic ns1:topic_0154 .\n",
            "\n",
            "ns1:data_1696 ns1:has_topic ns1:topic_0154 .\n",
            "\n",
            "ns1:data_1713 ns1:has_topic ns1:topic_3065 .\n",
            "\n",
            "ns1:data_1869 ns1:is_identifier_of ns1:data_2530 .\n",
            "\n",
            "ns1:data_1893 ns1:is_identifier_of ns1:data_2012 .\n",
            "\n",
            "ns1:data_2019 ns1:has_topic ns1:topic_0102 .\n",
            "\n",
            "ns1:data_2108 ns1:is_identifier_of ns1:data_2978 .\n",
            "\n",
            "ns1:data_2110 ns1:is_identifier_of ns1:data_2087 .\n",
            "\n",
            "ns1:data_2111 ns1:is_identifier_of ns1:data_1597,\n",
            "        ns1:data_1598 .\n",
            "\n",
            "ns1:data_2117 ns1:is_identifier_of ns1:data_1274 .\n",
            "\n",
            "ns1:data_2119 ns1:is_identifier_of ns1:data_2084 .\n",
            "\n",
            "ns1:data_2127 ns1:is_identifier_of ns1:data_1598 .\n",
            "\n",
            "ns1:data_2223 ns1:has_topic ns1:topic_0089 .\n",
            "\n",
            "ns1:data_2291 ns1:is_identifier_of ns1:data_0849 .\n",
            "\n",
            "ns1:data_2338 ns1:is_identifier_of ns1:data_0582 .\n",
            "\n",
            "ns1:data_2353 ns1:has_topic ns1:topic_0089 .\n",
            "\n",
            "ns1:data_2355 ns1:is_identifier_of ns1:data_2354 .\n",
            "\n",
            "ns1:data_2362 ns1:is_identifier_of ns1:data_0849 .\n",
            "\n",
            "ns1:data_2382 ns1:is_identifier_of ns1:data_2531 .\n",
            "\n",
            "ns1:data_2526 ns1:has_topic ns1:topic_3068 .\n",
            "\n",
            "ns1:data_2576 ns1:is_identifier_of ns1:data_2852 .\n",
            "\n",
            "ns1:data_2611 ns1:is_identifier_of ns1:data_1622 .\n",
            "\n",
            "ns1:data_2663 ns1:is_identifier_of ns1:data_1462,\n",
            "        ns1:data_2313 .\n",
            "\n",
            "ns1:data_2762 ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:data_2769 ns1:is_identifier_of ns1:data_1276 .\n",
            "\n",
            "ns1:data_2800 ns1:is_identifier_of ns1:data_1622 .\n",
            "\n",
            "ns1:data_2812 ns1:is_identifier_of ns1:data_2850,\n",
            "        ns1:data_2879 .\n",
            "\n",
            "ns1:data_2912 ns1:is_identifier_of ns1:data_0963 .\n",
            "\n",
            "ns1:data_3025 ns1:is_identifier_of ns1:data_2858 .\n",
            "\n",
            "ns1:data_3028 ns1:has_topic ns1:topic_0084 .\n",
            "\n",
            "ns1:data_3034 ns1:is_identifier_of ns1:data_1255 .\n",
            "\n",
            "ns1:data_3035 ns1:is_identifier_of ns1:data_0883 .\n",
            "\n",
            "ns1:data_3036 ns1:is_identifier_of ns1:data_2082 .\n",
            "\n",
            "ns1:data_3273 ns1:is_identifier_of ns1:data_3113 .\n",
            "\n",
            "ns1:data_3442 ns1:has_topic ns1:topic_3384 .\n",
            "\n",
            "ns1:data_3449 ns1:has_topic ns1:topic_2229 .\n",
            "\n",
            "ns1:data_3667 ns1:is_identifier_of ns1:data_1622 .\n",
            "\n",
            "ns1:data_3806 ns1:has_topic ns1:topic_1317 .\n",
            "\n",
            "ns1:data_3807 ns1:has_topic ns1:topic_1317 .\n",
            "\n",
            "ns1:data_3808 ns1:has_topic ns1:topic_1317 .\n",
            "\n",
            "ns1:data_3842 ns1:has_topic ns1:topic_0081 .\n",
            "\n",
            "ns1:data_3953 ns1:has_topic ns1:topic_1775 .\n",
            "\n",
            "ns1:format_1475 ns1:is_format_of ns1:data_0883,\n",
            "        ns1:data_3870 .\n",
            "\n",
            "ns1:format_1637 ns1:is_format_of ns1:data_1714 .\n",
            "\n",
            "ns1:format_1638 ns1:is_format_of ns1:data_3110 .\n",
            "\n",
            "ns1:format_1644 ns1:is_format_of ns1:data_3111 .\n",
            "\n",
            "ns1:format_1919 ns1:is_format_of ns1:data_0849 .\n",
            "\n",
            "ns1:format_1920 ns1:is_format_of ns1:data_1255 .\n",
            "\n",
            "ns1:format_1921 ns1:is_format_of ns1:data_0863 .\n",
            "\n",
            "ns1:format_2006 ns1:is_format_of ns1:data_0872 .\n",
            "\n",
            "ns1:format_2013 ns1:is_format_of ns1:data_2600 .\n",
            "\n",
            "ns1:format_2014 ns1:is_format_of ns1:data_0858 .\n",
            "\n",
            "ns1:format_2017 ns1:is_format_of ns1:data_1501 .\n",
            "\n",
            "ns1:format_2020 ns1:is_format_of ns1:data_0971 .\n",
            "\n",
            "ns1:format_2021 ns1:is_format_of ns1:data_0972 .\n",
            "\n",
            "ns1:format_2027 ns1:is_format_of ns1:data_2024 .\n",
            "\n",
            "ns1:format_2030 ns1:is_format_of ns1:data_0962 .\n",
            "\n",
            "ns1:format_2031 ns1:is_format_of ns1:data_0916 .\n",
            "\n",
            "ns1:format_2035 ns1:is_format_of ns1:data_0846 .\n",
            "\n",
            "ns1:format_2036 ns1:is_format_of ns1:data_0871 .\n",
            "\n",
            "ns1:format_2037 ns1:is_format_of ns1:data_1426 .\n",
            "\n",
            "ns1:format_2038 ns1:is_format_of ns1:data_1427 .\n",
            "\n",
            "ns1:format_2039 ns1:is_format_of ns1:data_1428 .\n",
            "\n",
            "ns1:format_2040 ns1:is_format_of ns1:data_1429 .\n",
            "\n",
            "ns1:format_2049 ns1:is_format_of ns1:data_1442 .\n",
            "\n",
            "ns1:format_2052 ns1:is_format_of ns1:data_0907 .\n",
            "\n",
            "ns1:format_2054 ns1:is_format_of ns1:data_0906 .\n",
            "\n",
            "ns1:format_2055 ns1:is_format_of ns1:data_0925 .\n",
            "\n",
            "ns1:format_2057 ns1:is_format_of ns1:data_0924 .\n",
            "\n",
            "ns1:format_2058 ns1:is_format_of ns1:data_2603 .\n",
            "\n",
            "ns1:format_2060 ns1:is_format_of ns1:data_1274 .\n",
            "\n",
            "ns1:format_2062 ns1:is_format_of ns1:data_0896 .\n",
            "\n",
            "ns1:format_2064 ns1:is_format_of ns1:data_1499 .\n",
            "\n",
            "ns1:format_2065 ns1:is_format_of ns1:data_1539 .\n",
            "\n",
            "ns1:format_2066 ns1:is_format_of ns1:data_0857 .\n",
            "\n",
            "ns1:format_2067 ns1:is_format_of ns1:data_0870 .\n",
            "\n",
            "ns1:format_2068 ns1:is_format_of ns1:data_1353 .\n",
            "\n",
            "ns1:format_2069 ns1:is_format_of ns1:data_1354 .\n",
            "\n",
            "ns1:format_2072 ns1:is_format_of ns1:data_1364 .\n",
            "\n",
            "ns1:format_2074 ns1:is_format_of ns1:data_1347 .\n",
            "\n",
            "ns1:format_2075 ns1:is_format_of ns1:data_3354,\n",
            "        ns1:data_3355 .\n",
            "\n",
            "ns1:format_2076 ns1:is_format_of ns1:data_0880 .\n",
            "\n",
            "ns1:format_2078 ns1:is_format_of ns1:data_1017 .\n",
            "\n",
            "ns1:format_2170 ns1:is_format_of ns1:data_1235 .\n",
            "\n",
            "ns1:format_2195 ns1:is_format_of ns1:data_0582 .\n",
            "\n",
            "ns1:format_2331 ns1:is_format_of ns1:data_2048 .\n",
            "\n",
            "ns1:format_2352 ns1:is_format_of ns1:data_0863,\n",
            "        ns1:data_1255,\n",
            "        ns1:data_1772,\n",
            "        ns1:data_2044,\n",
            "        ns1:data_3108 .\n",
            "\n",
            "ns1:format_2548 ns1:is_format_of ns1:data_1255 .\n",
            "\n",
            "ns1:format_2571 ns1:is_format_of ns1:data_2044 .\n",
            "\n",
            "ns1:format_2848 ns1:is_format_of ns1:data_0970,\n",
            "        ns1:data_2849 .\n",
            "\n",
            "ns1:format_2919 ns1:is_format_of ns1:data_3002 .\n",
            "\n",
            "ns1:format_2920 ns1:is_format_of ns1:data_1381 .\n",
            "\n",
            "ns1:format_2921 ns1:is_format_of ns1:data_3498 .\n",
            "\n",
            "ns1:format_3033 ns1:is_format_of ns1:data_2082 .\n",
            "\n",
            "ns1:format_3097 ns1:is_format_of ns1:data_0907 .\n",
            "\n",
            "ns1:format_3161 ns1:is_format_of ns1:data_3111 .\n",
            "\n",
            "ns1:format_3162 ns1:is_format_of ns1:data_3111 .\n",
            "\n",
            "ns1:format_3166 ns1:is_format_of ns1:data_2984 .\n",
            "\n",
            "ns1:format_3167 ns1:is_format_of ns1:data_2531 .\n",
            "\n",
            "ns1:format_3235 ns1:is_format_of ns1:data_3236 .\n",
            "\n",
            "ns1:format_3245 ns1:is_format_of ns1:data_2536 .\n",
            "\n",
            "ns1:format_3326 ns1:is_format_of ns1:data_0955 .\n",
            "\n",
            "ns1:format_3327 ns1:is_format_of ns1:data_0955 .\n",
            "\n",
            "ns1:format_3484 ns1:is_format_of ns1:data_3210 .\n",
            "\n",
            "ns1:format_3491 ns1:is_format_of ns1:data_3210 .\n",
            "\n",
            "ns1:format_3547 ns1:is_format_of ns1:data_2968 .\n",
            "\n",
            "ns1:format_3578 ns1:is_format_of ns1:data_3110 .\n",
            "\n",
            "ns1:format_3606 ns1:is_format_of ns1:data_2048 .\n",
            "\n",
            "ns1:format_3616 ns1:is_format_of ns1:data_0955 .\n",
            "\n",
            "ns1:format_3626 ns1:is_format_of ns1:data_1499 .\n",
            "\n",
            "ns1:format_3681 ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:format_3706 ns1:is_format_of ns1:data_3707 .\n",
            "\n",
            "ns1:format_3708 ns1:is_format_of ns1:data_3707 .\n",
            "\n",
            "ns1:format_3772 ns1:is_format_of ns1:data_0863,\n",
            "        ns1:data_1255,\n",
            "        ns1:data_1772,\n",
            "        ns1:data_2044,\n",
            "        ns1:data_3108 .\n",
            "\n",
            "ns1:format_3773 ns1:is_format_of ns1:data_0863,\n",
            "        ns1:data_1255,\n",
            "        ns1:data_1772,\n",
            "        ns1:data_2044,\n",
            "        ns1:data_3108 .\n",
            "\n",
            "ns1:format_3774 ns1:is_format_of ns1:data_0863,\n",
            "        ns1:data_1255 .\n",
            "\n",
            "ns1:format_3777 ns1:is_format_of ns1:data_2530,\n",
            "        ns1:data_3113,\n",
            "        ns1:data_3567 .\n",
            "\n",
            "ns1:format_3780 ns1:is_format_of ns1:data_3779 .\n",
            "\n",
            "ns1:format_3787 ns1:is_format_of ns1:data_3786 .\n",
            "\n",
            "ns1:format_3824 ns1:is_format_of ns1:data_3488 .\n",
            "\n",
            "ns1:format_3828 ns1:is_format_of ns1:data_3110 .\n",
            "\n",
            "ns1:format_3866 ns1:is_format_of ns1:data_3870 .\n",
            "\n",
            "ns1:format_3879 ns1:is_format_of ns1:data_3872 .\n",
            "\n",
            "ns1:format_3884 ns1:is_format_of ns1:data_3872 .\n",
            "\n",
            "ns1:format_3909 ns1:is_format_of ns1:data_1255 .\n",
            "\n",
            "ns1:format_3911 ns1:is_format_of ns1:data_2190 .\n",
            "\n",
            "ns1:format_3913 ns1:is_format_of ns1:data_2535,\n",
            "        ns1:data_3112 .\n",
            "\n",
            "ns1:format_3915 ns1:is_format_of ns1:data_2535,\n",
            "        ns1:data_3112 .\n",
            "\n",
            "ns1:format_3916 ns1:is_format_of ns1:data_2535,\n",
            "        ns1:data_3112 .\n",
            "\n",
            "ns1:format_3971 ns1:is_format_of ns1:data_3241 .\n",
            "\n",
            "ns1:format_3972 ns1:is_format_of ns1:data_3241 .\n",
            "\n",
            "ns1:format_4015 ns1:is_format_of ns1:data_3869 .\n",
            "\n",
            "ns1:format_4024 ns1:is_format_of ns1:data_0883 .\n",
            "\n",
            "ns1:format_4041 ns1:is_format_of ns1:data_4040 .\n",
            "\n",
            "ns1:format_4050 ns1:is_format_of ns1:data_2531 .\n",
            "\n",
            "ns1:format_4058 ns1:has_topic ns1:topic_3172 .\n",
            "\n",
            "ns1:format_4059 ns1:has_topic ns1:topic_0153 .\n",
            "\n",
            "ns1:operation_0226 ns1:has_input ns1:data_0582 ;\n",
            "    ns1:has_topic ns1:topic_0089 .\n",
            "\n",
            "ns1:operation_0227 ns1:has_output ns1:data_0955 .\n",
            "\n",
            "ns1:operation_0234 ns1:has_output ns1:data_1259 ;\n",
            "    ns1:has_topic ns1:topic_0157 .\n",
            "\n",
            "ns1:operation_0235 ns1:has_output ns1:data_1260 ;\n",
            "    ns1:has_topic ns1:topic_0157 .\n",
            "\n",
            "ns1:operation_0236 ns1:has_output ns1:data_1261 ;\n",
            "    ns1:has_topic ns1:topic_0157 .\n",
            "\n",
            "ns1:operation_0237 ns1:has_topic ns1:topic_0157 .\n",
            "\n",
            "ns1:operation_0238 ns1:has_output ns1:data_0858 ;\n",
            "    ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:operation_0239 ns1:has_output ns1:data_0858 ;\n",
            "    ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:operation_0240 ns1:has_output ns1:data_0858 ;\n",
            "    ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:operation_0245 ns1:has_topic ns1:topic_0166 .\n",
            "\n",
            "ns1:operation_0246 ns1:has_topic ns1:topic_0736 .\n",
            "\n",
            "ns1:operation_0248 ns1:has_topic ns1:topic_0130 .\n",
            "\n",
            "ns1:operation_0249 ns1:has_output ns1:data_2991 .\n",
            "\n",
            "ns1:operation_0252 ns1:has_output ns1:data_1534 ;\n",
            "    ns1:has_topic ns1:topic_0804 .\n",
            "\n",
            "ns1:operation_0253 ns1:has_output ns1:data_1255 ;\n",
            "    ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:operation_0256 ns1:has_input ns1:data_1255 ;\n",
            "    ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:operation_0258 ns1:has_input ns1:data_0863 .\n",
            "\n",
            "ns1:operation_0262 ns1:has_output ns1:data_0912 .\n",
            "\n",
            "ns1:operation_0264 ns1:has_topic ns1:topic_0114 .\n",
            "\n",
            "ns1:operation_0265 ns1:has_topic ns1:topic_3168 .\n",
            "\n",
            "ns1:operation_0268 ns1:has_output ns1:data_1277 .\n",
            "\n",
            "ns1:operation_0270 ns1:has_topic ns1:topic_0820 .\n",
            "\n",
            "ns1:operation_0272 ns1:has_topic ns1:topic_0130 .\n",
            "\n",
            "ns1:operation_0276 ns1:has_output ns1:data_2984 ;\n",
            "    ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:operation_0278 ns1:has_output ns1:data_0880 .\n",
            "\n",
            "ns1:operation_0279 ns1:has_output ns1:data_1596 .\n",
            "\n",
            "ns1:operation_0282 ns1:has_output ns1:data_1278 .\n",
            "\n",
            "ns1:operation_0283 ns1:has_output ns1:data_0927 ;\n",
            "    ns1:has_topic ns1:topic_0102 .\n",
            "\n",
            "ns1:operation_0284 ns1:has_output ns1:data_1597 .\n",
            "\n",
            "ns1:operation_0286 ns1:has_input ns1:data_1597,\n",
            "        ns1:data_2977 ;\n",
            "    ns1:has_output ns1:data_0914,\n",
            "        ns1:data_1597 ;\n",
            "    ns1:has_topic ns1:topic_0203 .\n",
            "\n",
            "ns1:operation_0287 ns1:has_output ns1:data_1263 ;\n",
            "    ns1:has_topic ns1:topic_0114 .\n",
            "\n",
            "ns1:operation_0289 ns1:has_output ns1:data_0870 ;\n",
            "    ns1:has_topic ns1:topic_0084 .\n",
            "\n",
            "ns1:operation_0290 ns1:has_output ns1:data_2044 .\n",
            "\n",
            "ns1:operation_0291 ns1:has_output ns1:data_1235 .\n",
            "\n",
            "ns1:operation_0292 ns1:has_output ns1:data_0863 .\n",
            "\n",
            "ns1:operation_0295 ns1:has_output ns1:data_0886 .\n",
            "\n",
            "ns1:operation_0296 ns1:has_input ns1:data_0863 ;\n",
            "    ns1:has_output ns1:data_1354 ;\n",
            "    ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:operation_0297 ns1:has_input ns1:data_0883,\n",
            "        ns1:data_0886 ;\n",
            "    ns1:has_output ns1:data_0889 .\n",
            "\n",
            "ns1:operation_0300 ns1:has_input ns1:data_1354 ;\n",
            "    ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:operation_0302 ns1:has_input ns1:data_1460 ;\n",
            "    ns1:has_output ns1:data_0893 .\n",
            "\n",
            "ns1:operation_0305 ns1:has_topic ns1:topic_3068 .\n",
            "\n",
            "ns1:operation_0306 ns1:has_input ns1:data_3671 ;\n",
            "    ns1:has_output ns1:data_0972 ;\n",
            "    ns1:has_topic ns1:topic_0218 .\n",
            "\n",
            "ns1:operation_0308 ns1:has_input ns1:data_2977 ;\n",
            "    ns1:has_output ns1:data_1240 ;\n",
            "    ns1:has_topic ns1:topic_0632 .\n",
            "\n",
            "ns1:operation_0309 ns1:has_input ns1:data_2977 ;\n",
            "    ns1:has_output ns1:data_2717 ;\n",
            "    ns1:has_topic ns1:topic_0203,\n",
            "        ns1:topic_0632 .\n",
            "\n",
            "ns1:operation_0310 ns1:has_output ns1:data_0925 ;\n",
            "    ns1:has_topic ns1:topic_0196 .\n",
            "\n",
            "ns1:operation_0313 ns1:has_output ns1:data_3111 .\n",
            "\n",
            "ns1:operation_0319 ns1:has_topic ns1:topic_1317,\n",
            "        ns1:topic_2814 .\n",
            "\n",
            "ns1:operation_0320 ns1:has_output ns1:data_1460 ;\n",
            "    ns1:has_topic ns1:topic_1317 .\n",
            "\n",
            "ns1:operation_0321 ns1:has_output ns1:data_1539 ;\n",
            "    ns1:has_topic ns1:topic_2275 .\n",
            "\n",
            "ns1:operation_0323 ns1:has_output ns1:data_0872 ;\n",
            "    ns1:has_topic ns1:topic_0080 .\n",
            "\n",
            "ns1:operation_0324 ns1:has_topic ns1:topic_0084 .\n",
            "\n",
            "ns1:operation_0326 ns1:has_input ns1:data_0872 ;\n",
            "    ns1:has_output ns1:data_0872 .\n",
            "\n",
            "ns1:operation_0327 ns1:has_topic ns1:topic_0194 .\n",
            "\n",
            "ns1:operation_0331 ns1:has_topic ns1:topic_0130,\n",
            "        ns1:topic_0199 .\n",
            "\n",
            "ns1:operation_0334 ns1:has_output ns1:data_2024 ;\n",
            "    ns1:has_topic ns1:topic_0821 .\n",
            "\n",
            "ns1:operation_0337 ns1:has_input ns1:data_2968 ;\n",
            "    ns1:has_output ns1:data_2968 ;\n",
            "    ns1:has_topic ns1:topic_0092 .\n",
            "\n",
            "ns1:operation_0338 ns1:has_output ns1:data_0857 .\n",
            "\n",
            "ns1:operation_0339 ns1:has_topic ns1:topic_0081 .\n",
            "\n",
            "ns1:operation_0361 ns1:has_input ns1:data_0849 ;\n",
            "    ns1:has_output ns1:data_0849 .\n",
            "\n",
            "ns1:operation_0365 ns1:has_output ns1:data_1239 .\n",
            "\n",
            "ns1:operation_0366 ns1:has_output ns1:data_1238 ;\n",
            "    ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:operation_0371 ns1:has_topic ns1:topic_0108 .\n",
            "\n",
            "ns1:operation_0372 ns1:has_topic ns1:topic_0203 .\n",
            "\n",
            "ns1:operation_0384 ns1:has_output ns1:data_1542 .\n",
            "\n",
            "ns1:operation_0386 ns1:has_output ns1:data_1545 .\n",
            "\n",
            "ns1:operation_0389 ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:operation_0391 ns1:has_output ns1:data_1546 .\n",
            "\n",
            "ns1:operation_0392 ns1:has_output ns1:data_1547 .\n",
            "\n",
            "ns1:operation_0393 ns1:has_output ns1:data_1548 .\n",
            "\n",
            "ns1:operation_0394 ns1:has_output ns1:data_1549 .\n",
            "\n",
            "ns1:operation_0396 ns1:has_output ns1:data_1544 .\n",
            "\n",
            "ns1:operation_0398 ns1:has_output ns1:data_1519 ;\n",
            "    ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:operation_0399 ns1:has_output ns1:data_1531 .\n",
            "\n",
            "ns1:operation_0400 ns1:has_output ns1:data_0897 ;\n",
            "    ns1:has_topic ns1:topic_0123 .\n",
            "\n",
            "ns1:operation_0402 ns1:has_output ns1:data_1527 .\n",
            "\n",
            "ns1:operation_0403 ns1:has_output ns1:data_1528 .\n",
            "\n",
            "ns1:operation_0404 ns1:has_output ns1:data_1530 .\n",
            "\n",
            "ns1:operation_0406 ns1:has_output ns1:data_1521 .\n",
            "\n",
            "ns1:operation_0407 ns1:has_output ns1:data_1520 .\n",
            "\n",
            "ns1:operation_0408 ns1:has_output ns1:data_1526 .\n",
            "\n",
            "ns1:operation_0409 ns1:has_output ns1:data_1524 .\n",
            "\n",
            "ns1:operation_0410 ns1:has_output ns1:data_1525 .\n",
            "\n",
            "ns1:operation_0415 ns1:has_output ns1:data_1276 ;\n",
            "    ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:operation_0416 ns1:has_topic ns1:topic_0804 .\n",
            "\n",
            "ns1:operation_0417 ns1:has_topic ns1:topic_0601 .\n",
            "\n",
            "ns1:operation_0418 ns1:has_topic ns1:topic_0140 .\n",
            "\n",
            "ns1:operation_0422 ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:operation_0429 ns1:has_output ns1:data_3128 .\n",
            "\n",
            "ns1:operation_0430 ns1:has_topic ns1:topic_0157 .\n",
            "\n",
            "ns1:operation_0431 ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:operation_0433 ns1:has_topic ns1:topic_0114 .\n",
            "\n",
            "ns1:operation_0437 ns1:has_output ns1:data_0916 .\n",
            "\n",
            "ns1:operation_0438 ns1:has_topic ns1:topic_0749 .\n",
            "\n",
            "ns1:operation_0439 ns1:has_topic ns1:topic_0108 .\n",
            "\n",
            "ns1:operation_0443 ns1:has_topic ns1:topic_0659 .\n",
            "\n",
            "ns1:operation_0446 ns1:has_topic ns1:topic_0114 .\n",
            "\n",
            "ns1:operation_0455 ns1:has_output ns1:data_2985 .\n",
            "\n",
            "ns1:operation_0456 ns1:has_output ns1:data_1583 .\n",
            "\n",
            "ns1:operation_0461 ns1:has_output ns1:data_0912 .\n",
            "\n",
            "ns1:operation_0464 ns1:has_topic ns1:topic_0659 .\n",
            "\n",
            "ns1:operation_0465 ns1:has_topic ns1:topic_0659 .\n",
            "\n",
            "ns1:operation_0474 ns1:has_output ns1:data_1460 .\n",
            "\n",
            "ns1:operation_0475 ns1:has_output ns1:data_1459 .\n",
            "\n",
            "ns1:operation_0477 ns1:has_topic ns1:topic_2275 .\n",
            "\n",
            "ns1:operation_0478 ns1:has_output ns1:data_1461,\n",
            "        ns1:data_2877 .\n",
            "\n",
            "ns1:operation_0482 ns1:has_output ns1:data_1461 ;\n",
            "    ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:operation_0483 ns1:has_output ns1:data_1234 .\n",
            "\n",
            "ns1:operation_0485 ns1:has_output ns1:data_2870 .\n",
            "\n",
            "ns1:operation_0487 ns1:has_output ns1:data_1863 .\n",
            "\n",
            "ns1:operation_0488 ns1:has_output ns1:data_0927 .\n",
            "\n",
            "ns1:operation_0489 ns1:has_output ns1:data_1598 .\n",
            "\n",
            "ns1:operation_0490 ns1:has_output ns1:data_0862 .\n",
            "\n",
            "ns1:operation_0491 ns1:has_output ns1:data_1381 .\n",
            "\n",
            "ns1:operation_0499 ns1:has_topic ns1:topic_0084 .\n",
            "\n",
            "ns1:operation_0502 ns1:has_input ns1:data_0880 ;\n",
            "    ns1:has_output ns1:data_0881 .\n",
            "\n",
            "ns1:operation_0531 ns1:has_output ns1:data_1636 .\n",
            "\n",
            "ns1:operation_0533 ns1:has_output ns1:data_2984 .\n",
            "\n",
            "ns1:operation_0541 ns1:has_input ns1:data_1426 .\n",
            "\n",
            "ns1:operation_0542 ns1:has_input ns1:data_2873 ;\n",
            "    ns1:has_topic ns1:topic_0203 .\n",
            "\n",
            "ns1:operation_0543 ns1:has_topic ns1:topic_0199 .\n",
            "\n",
            "ns1:operation_0550 ns1:has_output ns1:data_1439 ;\n",
            "    ns1:has_topic ns1:topic_0084 .\n",
            "\n",
            "ns1:operation_0553 ns1:has_output ns1:data_0916 ;\n",
            "    ns1:has_topic ns1:topic_0194 .\n",
            "\n",
            "ns1:operation_0557 ns1:has_output ns1:data_1442 .\n",
            "\n",
            "ns1:operation_0560 ns1:has_topic ns1:topic_0804 .\n",
            "\n",
            "ns1:operation_0564 ns1:has_input ns1:data_2044 ;\n",
            "    ns1:has_output ns1:data_2969 .\n",
            "\n",
            "ns1:operation_0566 ns1:has_input ns1:data_1235 .\n",
            "\n",
            "ns1:operation_0567 ns1:has_output ns1:data_0872 .\n",
            "\n",
            "ns1:operation_0570 ns1:has_input ns1:data_0883 ;\n",
            "    ns1:has_output ns1:data_1710 .\n",
            "\n",
            "ns1:operation_0571 ns1:has_input ns1:data_3117 .\n",
            "\n",
            "ns1:operation_0573 ns1:has_input ns1:data_1274 .\n",
            "\n",
            "ns1:operation_0575 ns1:has_output ns1:data_1289 .\n",
            "\n",
            "ns1:operation_0579 ns1:has_topic ns1:topic_0114 .\n",
            "\n",
            "ns1:operation_1777 ns1:has_topic ns1:topic_1775 .\n",
            "\n",
            "ns1:operation_1778 ns1:has_topic ns1:topic_1775 .\n",
            "\n",
            "ns1:operation_1781 ns1:has_topic ns1:topic_0602 .\n",
            "\n",
            "ns1:operation_1850 ns1:has_topic ns1:topic_0130 .\n",
            "\n",
            "ns1:operation_2008 ns1:has_topic ns1:topic_0659 .\n",
            "\n",
            "ns1:operation_2239 ns1:has_output ns1:data_1499 ;\n",
            "    ns1:has_topic ns1:topic_0081 .\n",
            "\n",
            "ns1:operation_2241 ns1:has_output ns1:data_2992 .\n",
            "\n",
            "ns1:operation_2403 ns1:has_topic ns1:topic_0080 .\n",
            "\n",
            "ns1:operation_2406 ns1:has_input ns1:data_1460 ;\n",
            "    ns1:has_topic ns1:topic_2814 .\n",
            "\n",
            "ns1:operation_2409 ns1:has_topic ns1:topic_3489 .\n",
            "\n",
            "ns1:operation_2415 ns1:has_output ns1:data_1537 ;\n",
            "    ns1:has_topic ns1:topic_0130 .\n",
            "\n",
            "ns1:operation_2416 ns1:has_output ns1:data_2956 ;\n",
            "    ns1:has_topic ns1:topic_2814 .\n",
            "\n",
            "ns1:operation_2419 ns1:has_topic ns1:topic_0632 .\n",
            "\n",
            "ns1:operation_2421 ns1:has_output ns1:data_2080 .\n",
            "\n",
            "ns1:operation_2422 ns1:has_input ns1:data_0842 .\n",
            "\n",
            "ns1:operation_2426 ns1:has_topic ns1:topic_2275 .\n",
            "\n",
            "ns1:operation_2436 ns1:has_output ns1:data_3754 ;\n",
            "    ns1:has_topic ns1:topic_1775 .\n",
            "\n",
            "ns1:operation_2439 ns1:has_topic ns1:topic_0097 .\n",
            "\n",
            "ns1:operation_2441 ns1:has_output ns1:data_1465 .\n",
            "\n",
            "ns1:operation_2442 ns1:has_output ns1:data_1464 .\n",
            "\n",
            "ns1:operation_2451 ns1:has_input ns1:data_2044 ;\n",
            "    ns1:has_output ns1:data_2955 .\n",
            "\n",
            "ns1:operation_2454 ns1:has_output ns1:data_0916 ;\n",
            "    ns1:has_topic ns1:topic_0114 .\n",
            "\n",
            "ns1:operation_2464 ns1:has_output ns1:data_0906 ;\n",
            "    ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:operation_2476 ns1:has_output ns1:data_0883 ;\n",
            "    ns1:has_topic ns1:topic_0082,\n",
            "        ns1:topic_0176 .\n",
            "\n",
            "ns1:operation_2478 ns1:has_input ns1:data_2977 ;\n",
            "    ns1:has_topic ns1:topic_0077 .\n",
            "\n",
            "ns1:operation_2479 ns1:has_input ns1:data_2976 ;\n",
            "    ns1:has_topic ns1:topic_0078 .\n",
            "\n",
            "ns1:operation_2480 ns1:has_topic ns1:topic_0081 .\n",
            "\n",
            "ns1:operation_2481 ns1:has_input ns1:data_1459 ;\n",
            "    ns1:has_topic ns1:topic_0097 .\n",
            "\n",
            "ns1:operation_2483 ns1:has_topic ns1:topic_0081 .\n",
            "\n",
            "ns1:operation_2485 ns1:has_output ns1:data_2162 .\n",
            "\n",
            "ns1:operation_2486 ns1:has_output ns1:data_2992 .\n",
            "\n",
            "ns1:operation_2487 ns1:has_input ns1:data_1460 .\n",
            "\n",
            "ns1:operation_2489 ns1:has_topic ns1:topic_0140 .\n",
            "\n",
            "ns1:operation_2492 ns1:has_output ns1:data_0906 ;\n",
            "    ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:operation_2495 ns1:has_topic ns1:topic_0203 .\n",
            "\n",
            "ns1:operation_2499 ns1:has_topic ns1:topic_0114 .\n",
            "\n",
            "ns1:operation_2510 ns1:has_topic ns1:topic_0108 .\n",
            "\n",
            "ns1:operation_2520 ns1:has_output ns1:data_1274 ;\n",
            "    ns1:has_topic ns1:topic_0102,\n",
            "        ns1:topic_0196 .\n",
            "\n",
            "ns1:operation_2574 ns1:has_output ns1:data_2970 ;\n",
            "    ns1:has_topic ns1:topic_0123 .\n",
            "\n",
            "ns1:operation_2575 ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:operation_2871 ns1:has_output ns1:data_1279 .\n",
            "\n",
            "ns1:operation_2930 ns1:has_output ns1:data_0897 .\n",
            "\n",
            "ns1:operation_2944 ns1:has_output ns1:data_1280 ;\n",
            "    ns1:has_topic ns1:topic_0102 .\n",
            "\n",
            "ns1:operation_2949 ns1:has_output ns1:data_0906 ;\n",
            "    ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:operation_2962 ns1:has_output ns1:data_2865 .\n",
            "\n",
            "ns1:operation_2964 ns1:has_output ns1:data_1602 .\n",
            "\n",
            "ns1:operation_3080 ns1:has_input ns1:data_0883 .\n",
            "\n",
            "ns1:operation_3092 ns1:has_output ns1:data_1277 ;\n",
            "    ns1:has_topic ns1:topic_0078,\n",
            "        ns1:topic_0160 .\n",
            "\n",
            "ns1:operation_3180 ns1:has_input ns1:data_0925 ;\n",
            "    ns1:has_output ns1:data_3181 ;\n",
            "    ns1:has_topic ns1:topic_0196 .\n",
            "\n",
            "ns1:operation_3185 ns1:has_topic ns1:topic_3168 .\n",
            "\n",
            "ns1:operation_3195 ns1:has_topic ns1:topic_3168 .\n",
            "\n",
            "ns1:operation_3211 ns1:has_output ns1:data_3210 .\n",
            "\n",
            "ns1:operation_3214 ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:operation_3215 ns1:has_input ns1:data_0943 .\n",
            "\n",
            "ns1:operation_3216 ns1:has_topic ns1:topic_0077 .\n",
            "\n",
            "ns1:operation_3221 ns1:has_topic ns1:topic_3174 .\n",
            "\n",
            "ns1:operation_3258 ns1:has_output ns1:data_0925 ;\n",
            "    ns1:has_topic ns1:topic_0196 .\n",
            "\n",
            "ns1:operation_3267 ns1:has_input ns1:data_2012 ;\n",
            "    ns1:has_output ns1:data_2012 .\n",
            "\n",
            "ns1:operation_3348 ns1:has_input ns1:data_2044 ;\n",
            "    ns1:has_topic ns1:topic_3077 .\n",
            "\n",
            "ns1:operation_3349 ns1:has_output ns1:data_3505 .\n",
            "\n",
            "ns1:operation_3351 ns1:has_topic ns1:topic_0123,\n",
            "        ns1:topic_0166 .\n",
            "\n",
            "ns1:operation_3357 ns1:has_output ns1:data_3358 .\n",
            "\n",
            "ns1:operation_3431 ns1:has_topic ns1:topic_0219 .\n",
            "\n",
            "ns1:operation_3437 ns1:has_topic ns1:topic_3068 .\n",
            "\n",
            "ns1:operation_3443 ns1:has_topic ns1:topic_3382 .\n",
            "\n",
            "ns1:operation_3446 ns1:has_topic ns1:topic_2229 .\n",
            "\n",
            "ns1:operation_3450 ns1:has_topic ns1:topic_2229 .\n",
            "\n",
            "ns1:operation_3457 ns1:has_topic ns1:topic_1317 .\n",
            "\n",
            "ns1:operation_3459 ns1:has_topic ns1:topic_1775 .\n",
            "\n",
            "ns1:operation_3461 ns1:has_topic ns1:topic_3301 .\n",
            "\n",
            "ns1:operation_3465 ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:operation_3469 ns1:has_topic ns1:topic_0097 .\n",
            "\n",
            "ns1:operation_3478 ns1:has_topic ns1:topic_0084 .\n",
            "\n",
            "ns1:operation_3482 ns1:has_topic ns1:topic_3301 .\n",
            "\n",
            "ns1:operation_3501 ns1:has_output ns1:data_3753 .\n",
            "\n",
            "ns1:operation_3502 ns1:has_topic ns1:topic_1775 .\n",
            "\n",
            "ns1:operation_3552 ns1:has_topic ns1:topic_3382 .\n",
            "\n",
            "ns1:operation_3627 ns1:has_input ns1:data_0943 .\n",
            "\n",
            "ns1:operation_3628 ns1:has_input ns1:data_0943 .\n",
            "\n",
            "ns1:operation_3629 ns1:has_input ns1:data_0943 .\n",
            "\n",
            "ns1:operation_3630 ns1:has_input ns1:data_0943 .\n",
            "\n",
            "ns1:operation_3631 ns1:has_input ns1:data_0943 .\n",
            "\n",
            "ns1:operation_3632 ns1:has_input ns1:data_0943 ;\n",
            "    ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:operation_3660 ns1:has_topic ns1:topic_2259 .\n",
            "\n",
            "ns1:operation_3766 ns1:has_topic ns1:topic_0602 .\n",
            "\n",
            "ns1:operation_3767 ns1:has_input ns1:data_0943 .\n",
            "\n",
            "ns1:operation_3778 ns1:has_input ns1:data_3671 ;\n",
            "    ns1:has_output ns1:data_3779 ;\n",
            "    ns1:has_topic ns1:topic_3068 .\n",
            "\n",
            "ns1:operation_3801 ns1:has_input ns1:data_0943 .\n",
            "\n",
            "ns1:operation_3860 ns1:has_input ns1:data_0943 .\n",
            "\n",
            "ns1:operation_3890 ns1:has_output ns1:data_2162 .\n",
            "\n",
            "ns1:operation_3893 ns1:has_output ns1:data_1439 ;\n",
            "    ns1:has_topic ns1:topic_0084 .\n",
            "\n",
            "ns1:operation_3899 ns1:has_output ns1:data_1461 ;\n",
            "    ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:operation_3900 ns1:has_output ns1:data_0906 ;\n",
            "    ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:operation_3901 ns1:has_output ns1:data_0906 ;\n",
            "    ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:operation_3904 ns1:has_topic ns1:topic_3301 .\n",
            "\n",
            "ns1:operation_3918 ns1:has_topic ns1:topic_0622 .\n",
            "\n",
            "ns1:operation_3920 ns1:has_topic ns1:topic_0622 .\n",
            "\n",
            "ns1:operation_3925 ns1:has_input ns1:data_2600 .\n",
            "\n",
            "ns1:operation_3926 ns1:has_input ns1:data_2600 .\n",
            "\n",
            "ns1:operation_3927 ns1:has_topic ns1:topic_0602,\n",
            "        ns1:topic_2259 .\n",
            "\n",
            "ns1:operation_3928 ns1:has_topic ns1:topic_0602,\n",
            "        ns1:topic_2259 .\n",
            "\n",
            "ns1:operation_3935 ns1:has_input ns1:data_0943 ;\n",
            "    ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:operation_3936 ns1:has_input ns1:data_0943 ;\n",
            "    ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:operation_3937 ns1:has_input ns1:data_0943 ;\n",
            "    ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:operation_3938 ns1:has_output ns1:data_1461 ;\n",
            "    ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:operation_3946 ns1:has_output ns1:data_1439 ;\n",
            "    ns1:has_topic ns1:topic_0084 .\n",
            "\n",
            "ns1:operation_3968 ns1:has_topic ns1:topic_0804 .\n",
            "\n",
            "ns1:operation_4031 ns1:has_input ns1:data_2042 ;\n",
            "    ns1:has_output ns1:data_0951 ;\n",
            "    ns1:has_topic ns1:topic_2269,\n",
            "        ns1:topic_3365,\n",
            "        ns1:topic_3572 .\n",
            "\n",
            "ns1:operation_4032 ns1:has_input ns1:data_3494 ;\n",
            "    ns1:has_output ns1:data_1276,\n",
            "        ns1:data_1772 ;\n",
            "    ns1:has_topic ns1:topic_0160,\n",
            "        ns1:topic_3295 .\n",
            "\n",
            "ns1:operation_4033 ns1:has_output ns1:data_2048 ;\n",
            "    ns1:has_topic ns1:topic_3305,\n",
            "        ns1:topic_3324 .\n",
            "\n",
            "ns1:operation_4034 ns1:has_input ns1:data_1669 ;\n",
            "    ns1:has_output ns1:data_3932 ;\n",
            "    ns1:has_topic ns1:topic_2269 .\n",
            "\n",
            "ns1:operation_4042 ns1:has_output ns1:data_4040 ;\n",
            "    ns1:has_topic ns1:topic_3071 .\n",
            "\n",
            "ns1:operation_4043 ns1:has_topic ns1:topic_4011 .\n",
            "\n",
            "ns1:topic_4038 skos:related ns1:topic_3923 .\n",
            "\n",
            "ns1:data_0006 a owl:Class .\n",
            "\n",
            "ns1:data_0842 a owl:Class ;\n",
            "    ns1:is_identifier_of ns1:data_0006 .\n",
            "\n",
            "ns1:data_0846 a owl:Class .\n",
            "\n",
            "ns1:data_0847 a owl:Class .\n",
            "\n",
            "ns1:data_0850 a owl:Class .\n",
            "\n",
            "ns1:data_0862 a owl:Class .\n",
            "\n",
            "ns1:data_0871 a owl:Class .\n",
            "\n",
            "ns1:data_0881 a owl:Class .\n",
            "\n",
            "ns1:data_0893 a owl:Class .\n",
            "\n",
            "ns1:data_0914 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0203 .\n",
            "\n",
            "ns1:data_0919 a owl:Class .\n",
            "\n",
            "ns1:data_0920 a owl:Class .\n",
            "\n",
            "ns1:data_0924 a owl:Class .\n",
            "\n",
            "ns1:data_0950 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_3307 .\n",
            "\n",
            "ns1:data_0951 a owl:Class .\n",
            "\n",
            "ns1:data_0963 a owl:Class .\n",
            "\n",
            "ns1:data_0970 a owl:Class .\n",
            "\n",
            "ns1:data_1017 a owl:Class .\n",
            "\n",
            "ns1:data_1234 a owl:Class .\n",
            "\n",
            "ns1:data_1238 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:data_1239 a owl:Class .\n",
            "\n",
            "ns1:data_1240 a owl:Class .\n",
            "\n",
            "ns1:data_1259 a owl:Class .\n",
            "\n",
            "ns1:data_1260 a owl:Class .\n",
            "\n",
            "ns1:data_1261 a owl:Class .\n",
            "\n",
            "ns1:data_1263 a owl:Class .\n",
            "\n",
            "ns1:data_1278 a owl:Class .\n",
            "\n",
            "ns1:data_1279 a owl:Class .\n",
            "\n",
            "ns1:data_1280 a owl:Class .\n",
            "\n",
            "ns1:data_1289 a owl:Class .\n",
            "\n",
            "ns1:data_1347 a owl:Class .\n",
            "\n",
            "ns1:data_1427 a owl:Class .\n",
            "\n",
            "ns1:data_1428 a owl:Class .\n",
            "\n",
            "ns1:data_1429 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0199 .\n",
            "\n",
            "ns1:data_1462 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0152,\n",
            "        ns1:topic_0153 .\n",
            "\n",
            "ns1:data_1464 a owl:Class .\n",
            "\n",
            "ns1:data_1465 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0097 .\n",
            "\n",
            "ns1:data_1467 a owl:Class .\n",
            "\n",
            "ns1:data_1468 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0736 .\n",
            "\n",
            "ns1:data_1519 a owl:Class .\n",
            "\n",
            "ns1:data_1520 a owl:Class .\n",
            "\n",
            "ns1:data_1521 a owl:Class .\n",
            "\n",
            "ns1:data_1524 a owl:Class .\n",
            "\n",
            "ns1:data_1525 a owl:Class .\n",
            "\n",
            "ns1:data_1526 a owl:Class .\n",
            "\n",
            "ns1:data_1527 a owl:Class .\n",
            "\n",
            "ns1:data_1528 a owl:Class .\n",
            "\n",
            "ns1:data_1530 a owl:Class .\n",
            "\n",
            "ns1:data_1531 a owl:Class .\n",
            "\n",
            "ns1:data_1534 a owl:Class .\n",
            "\n",
            "ns1:data_1537 a owl:Class .\n",
            "\n",
            "ns1:data_1542 a owl:Class .\n",
            "\n",
            "ns1:data_1544 a owl:Class .\n",
            "\n",
            "ns1:data_1545 a owl:Class .\n",
            "\n",
            "ns1:data_1546 a owl:Class .\n",
            "\n",
            "ns1:data_1547 a owl:Class .\n",
            "\n",
            "ns1:data_1548 a owl:Class .\n",
            "\n",
            "ns1:data_1549 a owl:Class .\n",
            "\n",
            "ns1:data_1583 a owl:Class .\n",
            "\n",
            "ns1:data_1596 a owl:Class .\n",
            "\n",
            "ns1:data_1602 a owl:Class .\n",
            "\n",
            "ns1:data_1636 a owl:Class .\n",
            "\n",
            "ns1:data_1669 a owl:Class .\n",
            "\n",
            "ns1:data_1710 a owl:Class .\n",
            "\n",
            "ns1:data_1714 a owl:Class .\n",
            "\n",
            "ns1:data_1863 a owl:Class .\n",
            "\n",
            "ns1:data_2016 a owl:Class .\n",
            "\n",
            "ns1:data_2042 a owl:Class .\n",
            "\n",
            "ns1:data_2080 a owl:Class .\n",
            "\n",
            "ns1:data_2084 a owl:Class .\n",
            "\n",
            "ns1:data_2087 a owl:Class .\n",
            "\n",
            "ns1:data_2190 a owl:Class .\n",
            "\n",
            "ns1:data_2313 a owl:Class .\n",
            "\n",
            "ns1:data_2354 a owl:Class .\n",
            "\n",
            "ns1:data_2536 a owl:Class .\n",
            "\n",
            "ns1:data_2603 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0203 .\n",
            "\n",
            "ns1:data_2717 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0632 .\n",
            "\n",
            "ns1:data_2849 a owl:Class .\n",
            "\n",
            "ns1:data_2850 a owl:Class .\n",
            "\n",
            "ns1:data_2851 a owl:Class .\n",
            "\n",
            "ns1:data_2852 a owl:Class .\n",
            "\n",
            "ns1:data_2858 a owl:Class .\n",
            "\n",
            "ns1:data_2865 a owl:Class .\n",
            "\n",
            "ns1:data_2870 a owl:Class .\n",
            "\n",
            "ns1:data_2873 a owl:Class .\n",
            "\n",
            "ns1:data_2877 a owl:Class .\n",
            "\n",
            "ns1:data_2879 a owl:Class .\n",
            "\n",
            "ns1:data_2955 a owl:Class .\n",
            "\n",
            "ns1:data_2956 a owl:Class .\n",
            "\n",
            "ns1:data_2969 a owl:Class .\n",
            "\n",
            "ns1:data_2970 a owl:Class .\n",
            "\n",
            "ns1:data_2978 a owl:Class .\n",
            "\n",
            "ns1:data_2985 a owl:Class .\n",
            "\n",
            "ns1:data_2991 a owl:Class .\n",
            "\n",
            "ns1:data_3002 a owl:Class .\n",
            "\n",
            "ns1:data_3117 a owl:Class .\n",
            "\n",
            "ns1:data_3128 a owl:Class .\n",
            "\n",
            "ns1:data_3181 a owl:Class .\n",
            "\n",
            "ns1:data_3236 a owl:Class .\n",
            "\n",
            "ns1:data_3354 a owl:Class .\n",
            "\n",
            "ns1:data_3355 a owl:Class .\n",
            "\n",
            "ns1:data_3358 a owl:Class .\n",
            "\n",
            "ns1:data_3488 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_1317 .\n",
            "\n",
            "ns1:data_3494 a owl:Class .\n",
            "\n",
            "ns1:data_3498 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0199 .\n",
            "\n",
            "ns1:data_3505 a owl:Class .\n",
            "\n",
            "ns1:data_3567 a owl:Class .\n",
            "\n",
            "ns1:data_3753 a owl:Class .\n",
            "\n",
            "ns1:data_3754 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_1775 .\n",
            "\n",
            "ns1:data_3786 a owl:Class .\n",
            "\n",
            "ns1:data_3805 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_1317 .\n",
            "\n",
            "ns1:data_3869 a owl:Class .\n",
            "\n",
            "ns1:data_3932 a owl:Class .\n",
            "\n",
            "ns1:topic_0082 a owl:Class .\n",
            "\n",
            "ns1:topic_0092 a owl:Class .\n",
            "\n",
            "ns1:topic_0152 a owl:Class .\n",
            "\n",
            "ns1:topic_0176 a owl:Class .\n",
            "\n",
            "ns1:topic_0218 a owl:Class .\n",
            "\n",
            "ns1:topic_0219 a owl:Class .\n",
            "\n",
            "ns1:topic_0601 a owl:Class .\n",
            "\n",
            "ns1:topic_0634 a owl:Class .\n",
            "\n",
            "ns1:topic_0749 a owl:Class .\n",
            "\n",
            "ns1:topic_0820 a owl:Class .\n",
            "\n",
            "ns1:topic_0821 a owl:Class .\n",
            "\n",
            "ns1:topic_3065 a owl:Class .\n",
            "\n",
            "ns1:topic_3077 a owl:Class .\n",
            "\n",
            "ns1:topic_3172 a owl:Class .\n",
            "\n",
            "ns1:topic_3174 a owl:Class .\n",
            "\n",
            "ns1:topic_3295 a owl:Class .\n",
            "\n",
            "ns1:topic_3305 a owl:Class .\n",
            "\n",
            "ns1:topic_3307 a owl:Class .\n",
            "\n",
            "ns1:topic_3324 a owl:Class .\n",
            "\n",
            "ns1:topic_3365 a owl:Class .\n",
            "\n",
            "ns1:topic_3384 a owl:Class .\n",
            "\n",
            "ns1:topic_3572 a owl:Class .\n",
            "\n",
            "ns1:topic_3923 a owl:Class .\n",
            "\n",
            "ns1:topic_4011 a owl:Class .\n",
            "\n",
            "ns1:data_0857 a owl:Class .\n",
            "\n",
            "ns1:data_0870 a owl:Class .\n",
            "\n",
            "ns1:data_0874 a owl:Class .\n",
            "\n",
            "ns1:data_0889 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0081 .\n",
            "\n",
            "ns1:data_0896 a owl:Class .\n",
            "\n",
            "ns1:data_0897 a owl:Class .\n",
            "\n",
            "ns1:data_0912 a owl:Class .\n",
            "\n",
            "ns1:data_0927 a owl:Class .\n",
            "\n",
            "ns1:data_0962 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0154 .\n",
            "\n",
            "ns1:data_0971 a owl:Class .\n",
            "\n",
            "ns1:data_0972 a owl:Class .\n",
            "\n",
            "ns1:data_1277 a owl:Class .\n",
            "\n",
            "ns1:data_1353 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:data_1364 a owl:Class .\n",
            "\n",
            "ns1:data_1381 a owl:Class .\n",
            "\n",
            "ns1:data_1426 a owl:Class .\n",
            "\n",
            "ns1:data_1442 a owl:Class .\n",
            "\n",
            "ns1:data_1459 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0097 .\n",
            "\n",
            "ns1:data_1501 a owl:Class .\n",
            "\n",
            "ns1:data_1539 a owl:Class .\n",
            "\n",
            "ns1:data_2024 a owl:Class .\n",
            "\n",
            "ns1:data_2082 a owl:Class .\n",
            "\n",
            "ns1:data_2162 a owl:Class .\n",
            "\n",
            "ns1:data_2530 a owl:Class .\n",
            "\n",
            "ns1:data_2976 a owl:Class .\n",
            "\n",
            "ns1:data_2992 a owl:Class .\n",
            "\n",
            "ns1:data_3113 a owl:Class .\n",
            "\n",
            "ns1:data_3241 a owl:Class .\n",
            "\n",
            "ns1:data_3671 a owl:Class .\n",
            "\n",
            "ns1:data_3707 a owl:Class .\n",
            "\n",
            "ns1:data_3779 a owl:Class .\n",
            "\n",
            "ns1:data_3870 a owl:Class .\n",
            "\n",
            "ns1:data_3872 a owl:Class .\n",
            "\n",
            "ns1:data_4040 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_3071 .\n",
            "\n",
            "ns1:topic_0077 a owl:Class .\n",
            "\n",
            "ns1:topic_0078 a owl:Class .\n",
            "\n",
            "ns1:topic_0140 a owl:Class .\n",
            "\n",
            "ns1:topic_0153 a owl:Class .\n",
            "\n",
            "ns1:topic_0166 a owl:Class .\n",
            "\n",
            "ns1:topic_0194 a owl:Class .\n",
            "\n",
            "ns1:topic_0622 a owl:Class .\n",
            "\n",
            "ns1:topic_0623 a owl:Class .\n",
            "\n",
            "ns1:topic_0736 a owl:Class .\n",
            "\n",
            "ns1:topic_2269 a owl:Class .\n",
            "\n",
            "ns1:topic_3071 a owl:Class .\n",
            "\n",
            "ns1:topic_3382 a owl:Class .\n",
            "\n",
            "ns1:data_0880 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0097 .\n",
            "\n",
            "ns1:data_0886 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0081 .\n",
            "\n",
            "ns1:data_0907 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0623 .\n",
            "\n",
            "ns1:data_1276 a owl:Class .\n",
            "\n",
            "ns1:data_1355 a owl:Class .\n",
            "\n",
            "ns1:data_1439 a owl:Class .\n",
            "\n",
            "ns1:data_1499 a owl:Class .\n",
            "\n",
            "ns1:data_1622 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0634 .\n",
            "\n",
            "ns1:data_2012 a owl:Class .\n",
            "\n",
            "ns1:data_2048 a owl:Class .\n",
            "\n",
            "ns1:data_2535 a owl:Class .\n",
            "\n",
            "ns1:data_2968 a owl:Class .\n",
            "\n",
            "ns1:data_2984 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0602 .\n",
            "\n",
            "ns1:data_3108 a owl:Class .\n",
            "\n",
            "ns1:data_3110 a owl:Class .\n",
            "\n",
            "ns1:data_3112 a owl:Class .\n",
            "\n",
            "ns1:data_3210 a owl:Class .\n",
            "\n",
            "ns1:topic_0108 a owl:Class .\n",
            "\n",
            "ns1:topic_0123 a owl:Class .\n",
            "\n",
            "ns1:topic_0154 a owl:Class .\n",
            "\n",
            "ns1:topic_2229 a owl:Class .\n",
            "\n",
            "ns1:topic_2259 a owl:Class .\n",
            "\n",
            "ns1:topic_2275 a owl:Class .\n",
            "\n",
            "ns1:topic_3168 a owl:Class .\n",
            "\n",
            "ns1:topic_3301 a owl:Class .\n",
            "\n",
            "ns1:topic_3489 a owl:Class .\n",
            "\n",
            "ns1:data_0582 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0089 .\n",
            "\n",
            "ns1:data_0858 a owl:Class .\n",
            "\n",
            "ns1:data_0925 a owl:Class .\n",
            "\n",
            "ns1:data_0955 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_3489 .\n",
            "\n",
            "ns1:data_0957 a owl:Class .\n",
            "\n",
            "ns1:data_1235 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0623 .\n",
            "\n",
            "ns1:data_1274 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0102 .\n",
            "\n",
            "ns1:data_1354 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0160 .\n",
            "\n",
            "ns1:data_1461 a owl:Class .\n",
            "\n",
            "ns1:data_1598 a owl:Class .\n",
            "\n",
            "ns1:data_1772 a owl:Class .\n",
            "\n",
            "ns1:data_2531 a owl:Class .\n",
            "\n",
            "ns1:data_2600 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0602 .\n",
            "\n",
            "ns1:topic_0080 a owl:Class .\n",
            "\n",
            "ns1:topic_0089 a owl:Class .\n",
            "\n",
            "ns1:topic_0196 a owl:Class .\n",
            "\n",
            "ns1:topic_0199 a owl:Class .\n",
            "\n",
            "ns1:topic_0632 a owl:Class .\n",
            "\n",
            "ns1:topic_0659 a owl:Class .\n",
            "\n",
            "ns1:topic_0804 a owl:Class .\n",
            "\n",
            "ns1:topic_2814 a owl:Class .\n",
            "\n",
            "ns1:topic_3068 a owl:Class .\n",
            "\n",
            "ns1:data_0849 a owl:Class .\n",
            "\n",
            "ns1:data_0916 a owl:Class .\n",
            "\n",
            "ns1:data_1460 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_2814 .\n",
            "\n",
            "ns1:data_1597 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0203 .\n",
            "\n",
            "ns1:data_2977 a owl:Class .\n",
            "\n",
            "ns1:data_3111 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0203 .\n",
            "\n",
            "ns1:topic_0102 a owl:Class .\n",
            "\n",
            "ns1:topic_0130 a owl:Class .\n",
            "\n",
            "ns1:topic_0157 a owl:Class .\n",
            "\n",
            "ns1:data_0872 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0084 .\n",
            "\n",
            "ns1:topic_0097 a owl:Class .\n",
            "\n",
            "ns1:topic_0602 a owl:Class .\n",
            "\n",
            "ns1:data_0883 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0081 .\n",
            "\n",
            "ns1:data_0906 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0128 .\n",
            "\n",
            "ns1:topic_0114 a owl:Class .\n",
            "\n",
            "ns1:topic_1775 a owl:Class .\n",
            "\n",
            "ns1:topic_0081 a owl:Class .\n",
            "\n",
            "ns1:data_0863 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0080 .\n",
            "\n",
            "ns1:data_2044 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0080 .\n",
            "\n",
            "ns1:topic_0084 a owl:Class .\n",
            "\n",
            "ns1:topic_0203 a owl:Class .\n",
            "\n",
            "ns1:topic_1317 a owl:Class .\n",
            "\n",
            "ns1:data_1255 a owl:Class .\n",
            "\n",
            "ns1:topic_0128 a owl:Class .\n",
            "\n",
            "ns1:data_0943 a owl:Class ;\n",
            "    ns1:has_topic ns1:topic_0121 .\n",
            "\n",
            "ns1:topic_0121 a owl:Class .\n",
            "\n",
            "ns1:topic_0160 a owl:Class .\n",
            "\n",
            "\n"
          ]
        }
      ],
      "source": [
        "edam_kg_2 = edam_kg.query(rule_0).graph\n",
        "print(f\"EDAM after rule 0 has {len(edam_kg_2)} triples\")\n",
        "print(edam_kg_2.serialize(format=\"turtle\"))"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 32,
      "metadata": {},
      "outputs": [],
      "source": [
        "test_r_6 = \"\"\"\n",
        "PREFIX edam: <http://edamontology.org/>\n",
        "SELECT * WHERE {\n",
        "    ?concept rdf:type owl:Class .\n",
        "    ?concept edam:has_input ?data .\n",
        "    ?data edam:has_operation ?operation .\n",
        "}\n",
        "\"\"\"\n",
        "\n",
        "res = edam_kg_2.query(test_r_6)\n",
        "for row in res:\n",
        "    print(f\"{row.concept} has operation {row.operation} through input {row.data}\")"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "display_name": "abromics-kg",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.10.14"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 0
}
